app/views/admin/index.html.erb

<%= t('.its') %> <%= Time.now %>
<%= t('.we_have') %> <%= pluralize(@total_orders, t('.order')) %>.<br /><br />
---
SELECT COUNT(*) FROM "orders"