app/controllers/admin_controller.rb

  def index
    @total_orders = Order.count
    @user = User.find_by_id(session[:user_id])
---
SELECT COUNT(*) FROM "orders"
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1