app/controllers/carts_controller.rb

INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2012-07-18 07:02:41.000000', '2012-07-18 07:02:41.000000')
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = 980190962 LIMIT 1
DELETE FROM "carts" WHERE "carts"."id" = 980190962
---
  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy