app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1
---
  def edit
    @line_item = LineItem.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = 207281424 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2012-07-18 07:02:41.908458', '2012-07-18 07:02:41.908458')
INSERT INTO "line_items" ("updated_at", "order_id", "product_id", "cart_id", "quantity", "created_at") VALUES ('2012-07-24 01:09:42.718750', NULL, 207281424, 980190963, 1, '2012-07-24 01:09:42.718750')
UPDATE "line_items" SET "updated_at" = '2012-07-18 02:39:58.797638', "quantity" = 3 WHERE "line_items"."id" = 61
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1
---
  def update
    @line_item = LineItem.find(params[:id])

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1
DELETE FROM "line_items" WHERE "line_items"."id" = 980190962
---
  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy