app/controllers/orders_controller.rb

  def index
  	@user = User.find_by_id(session[:user_id])
  	if @user.admin == true
	    @orders = Order.paginate :page => params[:page], :order => 'created_at desc',
  	    :per_page => 10
---
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 980190963)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 980190963)

  def create
    @order = Order.new(params[:order])
    @customer = User.find_by_id(session[:user_id])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver
        @customer.orders << @order
---
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2012-07-22 14:40:14.767587', '2012-07-22 14:40:14.767587')
INSERT INTO "orders" ("updated_at", "pay_type", "address", "name", "email", "created_at") VALUES ('2012-07-25 01:21:37.171875', 'Check', '123 The Street', 'Dave Thomas', 'dave@example.com', '2012-07-25 01:21:37.171875')
DELETE FROM "carts" WHERE "carts"."id" = 980190963
SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 980190963)
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 980190963 LIMIT 1

  def update
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 980190962 LIMIT 1