app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY title
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
---
  def index
#    @products = Product.all
		@products = Product.paginate :page => params[:page], :order => 'title desc',
  	    :per_page => 5
		@user = User.find_by_id(session[:user_id])

SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
---
  def show
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("updated_at", "description", "created_at", "title", "price", "image_url") VALUES ('2012-07-23 09:13:02.500000', 'Wibbles are fun!', '2012-07-23 09:13:02.500000', 'Lorem Ipsum', 19.3, 'lorem.jpg')
---
  def create
    @product = Product.new(params[:product])
    @titles = ctitles

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
UPDATE "products" SET "updated_at" = '2012-07-23 09:13:02.671875', "description" = 'Wibbles are fun!', "title" = 'Lorem Ipsum', "price" = 19.3, "image_url" = 'lorem.jpg' WHERE "products"."id" = 980190962
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 980190962
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1
---
  def who_bought
    @product = Product.find(params[:id])