app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY name
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("updated_at", "name", "salt", "created_at", "hashed_password") VALUES ('2012-07-24 08:09:40.843750', 'sam', '372238080.0428750692615484', '2012-07-24 08:09:40.843750', '712da20521ef2f4c003c594227c90e936bbf306a832f4f5383f29ba6565beb43')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
UPDATE "users" SET "updated_at" = '2012-07-25 02:48:34.078125', "hashed_password" = '400bdc066bd041e0bde874793a186c443eb0c80a41b7eabc49dfa49294077e08', "name" = 'sam', "salt" = '357881880.998788771535528' WHERE "users"."id" = 980190962
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 980190962
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy